---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotPlaceBalusterPatterns
source: html/c53d0e6e-4c31-90d6-d742-c1e974aa8092.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotPlaceBalusterPatterns Property

Can't place Baluster Patterns

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPlaceBalusterPatterns { get; }
```